uat_chat/Documents/уатЗакрытиеЗаявокНаРемонты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>уатЗакрытиеЗаявокНаРемонты</Name>
			<Comment>Закрытие заявок на ремонты</Comment>
			<BasedOn>
				<xr:Item>Document.уатЗаявкаНаРемонт</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатЗаявкиНаРемонт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаРемонт</Name>
							<Comment>Заявка на ремонт</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаявкаНаРемонт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗакрытия</Name>
							<Comment>Причина закрытия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПозицияПроизводсвеннойПрограммы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатЗаявкиНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатЗаявкиНаРемонт</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРемонт</Name>
					<Comment>Заявка на ремонт</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбслуживания</Name>
					<Comment>Вид обслуживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыОбслуживанияТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/Documents/уатЗакрытиеЗаявокНаРемонты/Ext/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ
	|	уатЗаявкиНаРемонтОстатки.Организация,
	|	уатЗаявкиНаРемонтОстатки.ТС,
	|	уатЗаявкиНаРемонтОстатки.Колонна,
	|	уатЗаявкиНаРемонтОстатки.ЗаявкаНаРемонт,
	|	уатЗаявкиНаРемонтОстатки.ВидОбслуживания,
	|	уатЗаявкиНаРемонтОстатки.Номенклатура,
	|	уатЗаявкиНаРемонтОстатки.КоличествоОстаток КАК Количество,
	|	уатЗакрытиеЗаявокНаРемонтыЗаявки.Ссылка КАК Регистратор,
	|	уатЗакрытиеЗаявокНаРемонтыЗаявки.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|ИЗ
	|	РегистрНакопления.уатЗаявкиНаРемонт.Остатки(
	|			&МоментВремени,
	|			ЗаявкаНаРемонт В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					уатЗакрытиеЗаявокНаРемонтыЗаявки.ЗаявкаНаРемонт
	|				ИЗ
	|					Документ.уатЗакрытиеЗаявокНаРемонты.Заявки КАК уатЗакрытиеЗаявокНаРемонтыЗаявки
	|				ГДЕ
	|					уатЗакрытиеЗаявокНаРемонтыЗаявки.Ссылка = &Ссылка)) КАК уатЗаявкиНаРемонтОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатЗакрытиеЗаявокНаРемонты.Заявки КАК уатЗакрытиеЗаявокНаРемонтыЗаявки
	|		ПО уатЗаявкиНаРемонтОстатки.ЗаявкаНаРемонт = уатЗакрытиеЗаявокНаРемонтыЗаявки.ЗаявкаНаРемонт
	|			И уатЗаявкиНаРемонтОстатки.Организация = уатЗакрытиеЗаявокНаРемонтыЗаявки.Ссылка.Организация
	|			И уатЗаявкиНаРемонтОстатки.ТС = уатЗакрытиеЗаявокНаРемонтыЗаявки.ЗаявкаНаРемонт.ТС
	|			И уатЗаявкиНаРемонтОстатки.ВидОбслуживания = уатЗакрытиеЗаявокНаРемонтыЗаявки.ЗаявкаНаРемонт.ВидОбслуживания
	|ГДЕ
	|	уатЗакрытиеЗаявокНаРемонтыЗаявки.Ссылка = &Ссылка";
	
	мЗапрос.УстановитьПараметр("Ссылка"       , ДокументСсылка);
	мЗапрос.УстановитьПараметр("МоментВремени", ДокументСсылка.МоментВремени());
	
	ТаблицаЗаявокНаРемонт = мЗапрос.Выполнить().Выгрузить();   
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаявокНаРемонт"   , ТаблицаЗаявокНаРемонт);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт

КонецПроцедуры
